package com.oket.util.constants;

/**
 * 错误枚举
 */
public enum ErrorEnum {
	/*
	 * 错误信息
	 * */
	E_400("400", "请求处理异常，请稍后再试"),
	E_500("500", "请求方式有误,请检查 GET/POST"),
	E_501("501", "请求路径不存在"),
	E_502("502", "权限不足"),
	E_1001("1001", "缺少必填参数"),
	//油罐参数
	E_TANK_PARAM_120001("120001","更新油罐参数失败"),
	E_TANK_PARAM_120002("120002","油罐参数获取失败"),
	E_TANK_PARAM_120003("120003","盲区更新失败"),
	E_TANK_PARAM_120004("120004","报警参数更新失败"),
	E_TANK_PARAM_120005("120005","添加油罐参数失败"),
	//	角色相关   1开头
	E_10001("10001", "角色删除失败,尚有用户属于此角色"),
	E_10002("10002", "角色更新失败,无此角色或无权限处理该角色"),
	E_10003("10003", "角色创建失败，未选择资源"),
	E_10004("10004", "非法创建角色"),
	E_10005("10005", "角色名已经存在"),
	// 资源相关
	E_20001("20001","不存在此资源"),
	//登陆相关  3开头
	E_30001("30001", "登陆已过期,请重新登陆"),
	E_30002("30002", "账户已存在"),
	E_30003("30003", "账户修改失败"),
	E_30004("30002", "账户添加失败"),

    //公司相关  4开头
	E_40001("40001", "公司已经存在"),
	E_40002("40002", "没有上级公司资源"),
	E_40003("40003", "该公司已被禁用"),
	E_40004("40004", "公司没有找到"),
	//照片 5k开头
	E_50002("50002", "照片上传失败"),
	//用户 6
	E_60001("60001", "重置密码失败"),
	E_60002("60002", "用户不存在或已被禁用"),
	E_60003("60003", "原密码输入错误"),
	E_60004("60004", "密码输入错误"),
	E_60005("60005", "用户名或密码错误"),
	//油站 7
	E_70000("70000","油站名称已经存在"),
	E_70001("70001","增加油站失败"),
	E_70002("70002","油站编码已经存在"),
	E_70003("70003","修改油站失败"),
	E_70004("70004","修改油站状态失败"),
	E_70005("70005","远程获取油水高补偿值失败"),
	E_70006("70006","远程设置油水高补偿值失败"),
    E_70007("70007","控制台连接失败"),
    E_70008("70008","容积表读取失败"),
	E_70009("70009","控制台升级失败"),
	E_70010("70010","容积表文件有误"),
	E_70011("70011","报警参数读取失败"),
    E_70012("70012","该油站未同步油罐"),
    E_70013("70013","该油罐无历史罐表"),
	E_70014("70014","容积表格式有误"),
	E_70015("70015", "参数格式有误"),
	E_70016("70016", "时间有误，开始时间不得小于上一次结束时间"),
	//油品 8
	E_80001("80001","油品已经存在"),
	E_80002("80002","油品增加失败"),
	E_80003("80003","油品修改失败"),
	E_80004("80004","油品修改状态失败"),
	//卸油单位 81
	E_81001("81001","卸油单位已经存在"),
	E_81002("81002","卸油单位增加失败"),
	E_81003("81003","卸油单位修改失败"),
	E_81004("81004","卸油单位修改状态失败"),
	//升级文件管理文件上传
	E_90001("90001","文件上传失败"),
	E_90002("90002","文件上传失败,文件内容不能为空"),
	E_90003("90003","文件上传失败,已经存在同名文件"),
	E_100001("100001","有相关液位轨迹组正在后台匹配中,请稍后操作..."),

	E_NO_ALARM_TYPE("900001", "后台数据有误，协议中无相应报警类型"),
	E_NO_SENSOR_TYPE("900002", "后台数据有误，协议中无相应传感器类型"),
	E_NO_SENSOR_ALARM_TYPE("900003", "后台数据有误，协议中无相应传感器报警类型"),
	E_NO_OPERATE_TYPE("900004", "后台数据有误，协议中无相应操作类型"),
	E_NO_OIL_CODE_TYPE("900005", "后台数据有误，协议中无相应油品编码"),
	//测漏查询异常
	E_LeakUpdate("LeakUpdate","修改失败"),
	E_Leak("LEAK","测漏异常");
	private String errorCode;

	private String errorMsg;

	ErrorEnum(String errorCode, String errorMsg) {
		this.errorCode = errorCode;
		this.errorMsg = errorMsg;
	}

	public String getErrorCode() {
		return errorCode;
	}

	public String getErrorMsg() {
		return errorMsg;
	}

}